tests/unit/services/user/cassettes/TestUserStripe.test_user_link_to_plan_via_subscription.yaml

interactions:
- request:
    body: email=user%40holepunch.io&description=Holepunch+User+Id%3A+None
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '63'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - a0f9cd18-ed76-4d19-9514-9d5a9248f70d
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_6XuZJcYf8PqoPs", "request_duration_ms":
        113}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 9ec6bd3e1c2a 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/customers
  response:
    body:
      string: "{\n  \"id\": \"cus_FPz8CIEfaZWqP1\",\n  \"object\": \"customer\",\n
        \ \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"created\":
        1562878029,\n  \"currency\": null,\n  \"default_source\": null,\n  \"delinquent\":
        false,\n  \"description\": \"Holepunch User Id: None\",\n  \"discount\": null,\n
        \ \"email\": \"user@holepunch.io\",\n  \"invoice_prefix\": \"AB4AEF84\",\n
        \ \"invoice_settings\": {\n    \"custom_fields\": null,\n    \"default_payment_method\":
        null,\n    \"footer\": null\n  },\n  \"livemode\": false,\n  \"metadata\":
        {\n  },\n  \"name\": null,\n  \"phone\": null,\n  \"preferred_locales\": [\n\n
        \ ],\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FPz8CIEfaZWqP1/sources\"\n  },\n  \"subscriptions\":
        {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\":
        false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_FPz8CIEfaZWqP1/subscriptions\"\n
        \ },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FPz8CIEfaZWqP1/tax_ids\"\n  },\n  \"tax_info\":
        null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1153'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 20:47:09 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - a0f9cd18-ed76-4d19-9514-9d5a9248f70d
      original-request:
      - req_8r2Cb4tV7B2K4v
      request-id:
      - req_8r2Cb4tV7B2K4v
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: customer=cus_FPz8CIEfaZWqP1
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '27'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - e18d712b-cc1e-44a4-8d19-7f5555fe1c6c
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_8r2Cb4tV7B2K4v", "request_duration_ms":
        270}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 9ec6bd3e1c2a 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/payment_methods/pm_card_threeDSecure2Required/attach
  response:
    body:
      string: "{\n  \"id\": \"pm_1Ev9AXFWLfbqapoHFVPtnG3q\",\n  \"object\": \"payment_method\",\n
        \ \"billing_details\": {\n    \"address\": {\n      \"city\": null,\n      \"country\":
        null,\n      \"line1\": null,\n      \"line2\": null,\n      \"postal_code\":
        null,\n      \"state\": null\n    },\n    \"email\": null,\n    \"name\":
        null,\n    \"phone\": null\n  },\n  \"card\": {\n    \"brand\": \"visa\",\n
        \   \"checks\": {\n      \"address_line1_check\": null,\n      \"address_postal_code_check\":
        null,\n      \"cvc_check\": null\n    },\n    \"country\": \"IE\",\n    \"exp_month\":
        7,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"SYKi0niCGBrPVd6A\",\n
        \   \"funding\": \"credit\",\n    \"generated_from\": null,\n    \"last4\":
        \"3220\",\n    \"three_d_secure_usage\": {\n      \"supported\": true\n    },\n
        \   \"wallet\": null\n  },\n  \"created\": 1562878029,\n  \"customer\": \"cus_FPz8CIEfaZWqP1\",\n
        \ \"livemode\": false,\n  \"metadata\": {\n  },\n  \"type\": \"card\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '849'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 20:47:09 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - e18d712b-cc1e-44a4-8d19-7f5555fe1c6c
      original-request:
      - req_4isqKmIcy2CcDk
      request-id:
      - req_4isqKmIcy2CcDk
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: customer=cus_FPz8CIEfaZWqP1&default_payment_method=pm_1Ev9AXFWLfbqapoHFVPtnG3q&items[0][plan]=plan_FHjqReterVJV8l&expand[0]=latest_invoice.payment_intent
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '153'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 830ac1e6-1149-41e1-8aeb-099037590655
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_4isqKmIcy2CcDk", "request_duration_ms":
        429}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 9ec6bd3e1c2a 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/subscriptions
  response:
    body:
      string: "{\n  \"id\": \"sub_FPz8ORHTa3a6Xl\",\n  \"object\": \"subscription\",\n
        \ \"application_fee_percent\": null,\n  \"billing\": \"charge_automatically\",\n
        \ \"billing_cycle_anchor\": 1562878029,\n  \"billing_thresholds\": null,\n
        \ \"cancel_at\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\":
        null,\n  \"collection_method\": \"charge_automatically\",\n  \"created\":
        1562878029,\n  \"current_period_end\": 1565556429,\n  \"current_period_start\":
        1562878029,\n  \"customer\": \"cus_FPz8CIEfaZWqP1\",\n  \"days_until_due\":
        null,\n  \"default_payment_method\": \"pm_1Ev9AXFWLfbqapoHFVPtnG3q\",\n  \"default_source\":
        null,\n  \"default_tax_rates\": [\n\n  ],\n  \"discount\": null,\n  \"ended_at\":
        null,\n  \"items\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n
        \       \"id\": \"si_FPz8KtPiY8LHKI\",\n        \"object\": \"subscription_item\",\n
        \       \"billing_thresholds\": null,\n        \"created\": 1562878030,\n
        \       \"metadata\": {\n        },\n        \"plan\": {\n          \"id\":
        \"plan_FHjqReterVJV8l\",\n          \"object\": \"plan\",\n          \"active\":
        true,\n          \"aggregate_usage\": null,\n          \"amount\": 999,\n
        \         \"billing_scheme\": \"per_unit\",\n          \"created\": 1560976015,\n
        \         \"currency\": \"usd\",\n          \"interval\": \"month\",\n          \"interval_count\":
        1,\n          \"livemode\": false,\n          \"metadata\": {\n          },\n
        \         \"nickname\": \"Holepunch Service: paid\",\n          \"product\":
        \"holepunch\",\n          \"tiers\": null,\n          \"tiers_mode\": null,\n
        \         \"transform_usage\": null,\n          \"trial_period_days\": null,\n
        \         \"usage_type\": \"licensed\"\n        },\n        \"quantity\":
        1,\n        \"subscription\": \"sub_FPz8ORHTa3a6Xl\",\n        \"tax_rates\":
        [\n\n        ]\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\":
        1,\n    \"url\": \"/v1/subscription_items?subscription=sub_FPz8ORHTa3a6Xl\"\n
        \ },\n  \"latest_invoice\": {\n    \"id\": \"in_1Ev9AYFWLfbqapoHcKu8vBCQ\",\n
        \   \"object\": \"invoice\",\n    \"account_country\": \"US\",\n    \"account_name\":
        \"ORB.HOUSE, LLC\",\n    \"amount_due\": 999,\n    \"amount_paid\": 0,\n    \"amount_remaining\":
        999,\n    \"application_fee_amount\": null,\n    \"attempt_count\": 0,\n    \"attempted\":
        true,\n    \"auto_advance\": true,\n    \"billing\": \"charge_automatically\",\n
        \   \"billing_reason\": \"subscription_create\",\n    \"charge\": null,\n
        \   \"collection_method\": \"charge_automatically\",\n    \"created\": 1562878029,\n
        \   \"currency\": \"usd\",\n    \"custom_fields\": null,\n    \"customer\":
        \"cus_FPz8CIEfaZWqP1\",\n    \"customer_address\": null,\n    \"customer_email\":
        \"user@holepunch.io\",\n    \"customer_name\": null,\n    \"customer_phone\":
        null,\n    \"customer_shipping\": null,\n    \"customer_tax_exempt\": \"none\",\n
        \   \"customer_tax_ids\": [\n\n    ],\n    \"default_payment_method\": null,\n
        \   \"default_source\": null,\n    \"default_tax_rates\": [\n\n    ],\n    \"description\":
        null,\n    \"discount\": null,\n    \"due_date\": null,\n    \"ending_balance\":
        0,\n    \"footer\": null,\n    \"hosted_invoice_url\": \"https://pay.stripe.com/invoice/invst_ffosKZlhnTGPHPjjSXnEhWkDNi\",\n
        \   \"invoice_pdf\": \"https://pay.stripe.com/invoice/invst_ffosKZlhnTGPHPjjSXnEhWkDNi/pdf\",\n
        \   \"lines\": {\n      \"object\": \"list\",\n      \"data\": [\n        {\n
        \         \"id\": \"sli_ccbb3fa6c94a5d\",\n          \"object\": \"line_item\",\n
        \         \"amount\": 999,\n          \"currency\": \"usd\",\n          \"description\":
        \"1 \xD7 Holepunch.io (at $9.99 / month)\",\n          \"discountable\": true,\n
        \         \"livemode\": false,\n          \"metadata\": {\n          },\n
        \         \"period\": {\n            \"end\": 1565556429,\n            \"start\":
        1562878029\n          },\n          \"plan\": {\n            \"id\": \"plan_FHjqReterVJV8l\",\n
        \           \"object\": \"plan\",\n            \"active\": true,\n            \"aggregate_usage\":
        null,\n            \"amount\": 999,\n            \"billing_scheme\": \"per_unit\",\n
        \           \"created\": 1560976015,\n            \"currency\": \"usd\",\n
        \           \"interval\": \"month\",\n            \"interval_count\": 1,\n
        \           \"livemode\": false,\n            \"metadata\": {\n            },\n
        \           \"nickname\": \"Holepunch Service: paid\",\n            \"product\":
        \"holepunch\",\n            \"tiers\": null,\n            \"tiers_mode\":
        null,\n            \"transform_usage\": null,\n            \"trial_period_days\":
        null,\n            \"usage_type\": \"licensed\"\n          },\n          \"proration\":
        false,\n          \"quantity\": 1,\n          \"subscription\": \"sub_FPz8ORHTa3a6Xl\",\n
        \         \"subscription_item\": \"si_FPz8KtPiY8LHKI\",\n          \"tax_amounts\":
        [\n\n          ],\n          \"tax_rates\": [\n\n          ],\n          \"type\":
        \"subscription\"\n        }\n      ],\n      \"has_more\": false,\n      \"total_count\":
        1,\n      \"url\": \"/v1/invoices/in_1Ev9AYFWLfbqapoHcKu8vBCQ/lines\"\n    },\n
        \   \"livemode\": false,\n    \"metadata\": {\n    },\n    \"next_payment_attempt\":
        null,\n    \"number\": \"AB4AEF84-0001\",\n    \"paid\": false,\n    \"payment_intent\":
        {\n      \"id\": \"pi_1Ev9AYFWLfbqapoH46QDrshy\",\n      \"object\": \"payment_intent\",\n
        \     \"amount\": 999,\n      \"amount_capturable\": 0,\n      \"amount_received\":
        0,\n      \"application\": null,\n      \"application_fee_amount\": null,\n
        \     \"canceled_at\": null,\n      \"cancellation_reason\": null,\n      \"capture_method\":
        \"automatic\",\n      \"charges\": {\n        \"object\": \"list\",\n        \"data\":
        [\n\n        ],\n        \"has_more\": false,\n        \"total_count\": 0,\n
        \       \"url\": \"/v1/charges?payment_intent=pi_1Ev9AYFWLfbqapoH46QDrshy\"\n
        \     },\n      \"client_secret\": \"pi_1Ev9AYFWLfbqapoH46QDrshy_secret_fS3gd4Vksxkt2WoTUro8IYV73\",\n
        \     \"confirmation_method\": \"automatic\",\n      \"created\": 1562878030,\n
        \     \"currency\": \"usd\",\n      \"customer\": \"cus_FPz8CIEfaZWqP1\",\n
        \     \"description\": \"Payment for invoice AB4AEF84-0001\",\n      \"invoice\":
        \"in_1Ev9AYFWLfbqapoHcKu8vBCQ\",\n      \"last_payment_error\": null,\n      \"livemode\":
        false,\n      \"metadata\": {\n      },\n      \"next_action\": {\n        \"type\":
        \"use_stripe_sdk\",\n        \"use_stripe_sdk\": {\n          \"type\": \"three_d_secure_redirect\",\n
        \         \"stripe_js\": \"https://hooks.stripe.com/3d_secure_2_eap/begin_test/src_1Ev9AYFWLfbqapoHz81GVTgy/src_client_secret_FPz8m6nuEO2SMhIfFz8rHTLq\"\n
        \       }\n      },\n      \"on_behalf_of\": null,\n      \"payment_method\":
        \"pm_1Ev9AXFWLfbqapoHFVPtnG3q\",\n      \"payment_method_types\": [\n        \"card\"\n
        \     ],\n      \"receipt_email\": null,\n      \"review\": null,\n      \"setup_future_usage\":
        null,\n      \"shipping\": null,\n      \"source\": null,\n      \"statement_descriptor\":
        null,\n      \"status\": \"requires_action\",\n      \"transfer_data\": null,\n
        \     \"transfer_group\": null\n    },\n    \"period_end\": 1562878029,\n
        \   \"period_start\": 1562878029,\n    \"post_payment_credit_notes_amount\":
        0,\n    \"pre_payment_credit_notes_amount\": 0,\n    \"receipt_number\": null,\n
        \   \"starting_balance\": 0,\n    \"statement_descriptor\": null,\n    \"status\":
        \"open\",\n    \"status_transitions\": {\n      \"finalized_at\": 1562878030,\n
        \     \"marked_uncollectible_at\": null,\n      \"paid_at\": null,\n      \"voided_at\":
        null\n    },\n    \"subscription\": \"sub_FPz8ORHTa3a6Xl\",\n    \"subtotal\":
        999,\n    \"tax\": null,\n    \"tax_percent\": null,\n    \"total\": 999,\n
        \   \"total_tax_amounts\": [\n\n    ],\n    \"webhooks_delivered_at\": null\n
        \ },\n  \"livemode\": false,\n  \"metadata\": {\n  },\n  \"plan\": {\n    \"id\":
        \"plan_FHjqReterVJV8l\",\n    \"object\": \"plan\",\n    \"active\": true,\n
        \   \"aggregate_usage\": null,\n    \"amount\": 999,\n    \"billing_scheme\":
        \"per_unit\",\n    \"created\": 1560976015,\n    \"currency\": \"usd\",\n
        \   \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\":
        false,\n    \"metadata\": {\n    },\n    \"nickname\": \"Holepunch Service:
        paid\",\n    \"product\": \"holepunch\",\n    \"tiers\": null,\n    \"tiers_mode\":
        null,\n    \"transform_usage\": null,\n    \"trial_period_days\": null,\n
        \   \"usage_type\": \"licensed\"\n  },\n  \"quantity\": 1,\n  \"schedule\":
        null,\n  \"start\": 1562878029,\n  \"start_date\": 1562878029,\n  \"status\":
        \"incomplete\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\":
        null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '7717'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 20:47:10 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 830ac1e6-1149-41e1-8aeb-099037590655
      original-request:
      - req_HXodjhHQj2F9Qh
      request-id:
      - req_HXodjhHQj2F9Qh
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_HXodjhHQj2F9Qh", "request_duration_ms":
        950}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 9ec6bd3e1c2a 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: GET
    uri: https://api.stripe.com/v1/subscriptions?plan=plan_FHjqReterVJV8l&customer=cus_FPz8CIEfaZWqP1
  response:
    body:
      string: "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"sub_FPz8ORHTa3a6Xl\",\n
        \     \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n
        \     \"billing\": \"charge_automatically\",\n      \"billing_cycle_anchor\":
        1562878029,\n      \"billing_thresholds\": null,\n      \"cancel_at\": null,\n
        \     \"cancel_at_period_end\": false,\n      \"canceled_at\": null,\n      \"collection_method\":
        \"charge_automatically\",\n      \"created\": 1562878029,\n      \"current_period_end\":
        1565556429,\n      \"current_period_start\": 1562878029,\n      \"customer\":
        \"cus_FPz8CIEfaZWqP1\",\n      \"days_until_due\": null,\n      \"default_payment_method\":
        \"pm_1Ev9AXFWLfbqapoHFVPtnG3q\",\n      \"default_source\": null,\n      \"default_tax_rates\":
        [\n\n      ],\n      \"discount\": null,\n      \"ended_at\": null,\n      \"items\":
        {\n        \"object\": \"list\",\n        \"data\": [\n          {\n            \"id\":
        \"si_FPz8KtPiY8LHKI\",\n            \"object\": \"subscription_item\",\n            \"billing_thresholds\":
        null,\n            \"created\": 1562878030,\n            \"metadata\": {\n
        \           },\n            \"plan\": {\n              \"id\": \"plan_FHjqReterVJV8l\",\n
        \             \"object\": \"plan\",\n              \"active\": true,\n              \"aggregate_usage\":
        null,\n              \"amount\": 999,\n              \"billing_scheme\": \"per_unit\",\n
        \             \"created\": 1560976015,\n              \"currency\": \"usd\",\n
        \             \"interval\": \"month\",\n              \"interval_count\":
        1,\n              \"livemode\": false,\n              \"metadata\": {\n              },\n
        \             \"nickname\": \"Holepunch Service: paid\",\n              \"product\":
        \"holepunch\",\n              \"tiers\": null,\n              \"tiers_mode\":
        null,\n              \"transform_usage\": null,\n              \"trial_period_days\":
        null,\n              \"usage_type\": \"licensed\"\n            },\n            \"quantity\":
        1,\n            \"subscription\": \"sub_FPz8ORHTa3a6Xl\",\n            \"tax_rates\":
        [\n\n            ]\n          }\n        ],\n        \"has_more\": false,\n
        \       \"total_count\": 1,\n        \"url\": \"/v1/subscription_items?subscription=sub_FPz8ORHTa3a6Xl\"\n
        \     },\n      \"latest_invoice\": \"in_1Ev9AYFWLfbqapoHcKu8vBCQ\",\n      \"livemode\":
        false,\n      \"metadata\": {\n      },\n      \"plan\": {\n        \"id\":
        \"plan_FHjqReterVJV8l\",\n        \"object\": \"plan\",\n        \"active\":
        true,\n        \"aggregate_usage\": null,\n        \"amount\": 999,\n        \"billing_scheme\":
        \"per_unit\",\n        \"created\": 1560976015,\n        \"currency\": \"usd\",\n
        \       \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\":
        false,\n        \"metadata\": {\n        },\n        \"nickname\": \"Holepunch
        Service: paid\",\n        \"product\": \"holepunch\",\n        \"tiers\":
        null,\n        \"tiers_mode\": null,\n        \"transform_usage\": null,\n
        \       \"trial_period_days\": null,\n        \"usage_type\": \"licensed\"\n
        \     },\n      \"quantity\": 1,\n      \"schedule\": null,\n      \"start\":
        1562878029,\n      \"start_date\": 1562878029,\n      \"status\": \"incomplete\",\n
        \     \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\":
        null\n    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/subscriptions\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '3052'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 20:47:11 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_KsBtsY32EpyM8c
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_KsBtsY32EpyM8c", "request_duration_ms":
        147}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 9ec6bd3e1c2a 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: GET
    uri: https://api.stripe.com/v1/subscriptions/sub_FPz8ORHTa3a6Xl?expand%5B0%5D=plan
  response:
    body:
      string: "{\n  \"id\": \"sub_FPz8ORHTa3a6Xl\",\n  \"object\": \"subscription\",\n
        \ \"application_fee_percent\": null,\n  \"billing\": \"charge_automatically\",\n
        \ \"billing_cycle_anchor\": 1562878029,\n  \"billing_thresholds\": null,\n
        \ \"cancel_at\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\":
        null,\n  \"collection_method\": \"charge_automatically\",\n  \"created\":
        1562878029,\n  \"current_period_end\": 1565556429,\n  \"current_period_start\":
        1562878029,\n  \"customer\": \"cus_FPz8CIEfaZWqP1\",\n  \"days_until_due\":
        null,\n  \"default_payment_method\": \"pm_1Ev9AXFWLfbqapoHFVPtnG3q\",\n  \"default_source\":
        null,\n  \"default_tax_rates\": [\n\n  ],\n  \"discount\": null,\n  \"ended_at\":
        null,\n  \"items\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n
        \       \"id\": \"si_FPz8KtPiY8LHKI\",\n        \"object\": \"subscription_item\",\n
        \       \"billing_thresholds\": null,\n        \"created\": 1562878030,\n
        \       \"metadata\": {\n        },\n        \"plan\": {\n          \"id\":
        \"plan_FHjqReterVJV8l\",\n          \"object\": \"plan\",\n          \"active\":
        true,\n          \"aggregate_usage\": null,\n          \"amount\": 999,\n
        \         \"billing_scheme\": \"per_unit\",\n          \"created\": 1560976015,\n
        \         \"currency\": \"usd\",\n          \"interval\": \"month\",\n          \"interval_count\":
        1,\n          \"livemode\": false,\n          \"metadata\": {\n          },\n
        \         \"nickname\": \"Holepunch Service: paid\",\n          \"product\":
        \"holepunch\",\n          \"tiers\": null,\n          \"tiers_mode\": null,\n
        \         \"transform_usage\": null,\n          \"trial_period_days\": null,\n
        \         \"usage_type\": \"licensed\"\n        },\n        \"quantity\":
        1,\n        \"subscription\": \"sub_FPz8ORHTa3a6Xl\",\n        \"tax_rates\":
        [\n\n        ]\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\":
        1,\n    \"url\": \"/v1/subscription_items?subscription=sub_FPz8ORHTa3a6Xl\"\n
        \ },\n  \"latest_invoice\": \"in_1Ev9AYFWLfbqapoHcKu8vBCQ\",\n  \"livemode\":
        false,\n  \"metadata\": {\n  },\n  \"plan\": {\n    \"id\": \"plan_FHjqReterVJV8l\",\n
        \   \"object\": \"plan\",\n    \"active\": true,\n    \"aggregate_usage\":
        null,\n    \"amount\": 999,\n    \"billing_scheme\": \"per_unit\",\n    \"created\":
        1560976015,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\":
        1,\n    \"livemode\": false,\n    \"metadata\": {\n    },\n    \"nickname\":
        \"Holepunch Service: paid\",\n    \"product\": \"holepunch\",\n    \"tiers\":
        null,\n    \"tiers_mode\": null,\n    \"transform_usage\": null,\n    \"trial_period_days\":
        null,\n    \"usage_type\": \"licensed\"\n  },\n  \"quantity\": 1,\n  \"schedule\":
        null,\n  \"start\": 1562878029,\n  \"start_date\": 1562878029,\n  \"status\":
        \"incomplete\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\":
        null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '2565'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 20:47:11 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_0bmGaCd4j65kNz
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
version: 1
