tests/unit/services/user/cassettes/TestUserStripeLink.test_user_fails_to_subscribe_decline.yaml

interactions:
- request:
    body: email=user%40holepunch.io&description=HP+TEST+2019-07-11+21%3A46%3A40.677500+None
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '81'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 6eadd6b6-fa24-44d8-82af-a813c8cade0e
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 57fc6466a65c 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/customers
  response:
    body:
      string: "{\n  \"id\": \"cus_FQ06nHzrm6ySuO\",\n  \"object\": \"customer\",\n
        \ \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"created\":
        1562881600,\n  \"currency\": null,\n  \"default_source\": null,\n  \"delinquent\":
        false,\n  \"description\": \"HP TEST 2019-07-11 21:46:40.677500 None\",\n
        \ \"discount\": null,\n  \"email\": \"user@holepunch.io\",\n  \"invoice_prefix\":
        \"68ECEBEB\",\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n    \"default_payment_method\":
        null,\n    \"footer\": null\n  },\n  \"livemode\": false,\n  \"metadata\":
        {\n  },\n  \"name\": null,\n  \"phone\": null,\n  \"preferred_locales\": [\n\n
        \ ],\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FQ06nHzrm6ySuO/sources\"\n  },\n  \"subscriptions\":
        {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\":
        false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_FQ06nHzrm6ySuO/subscriptions\"\n
        \ },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FQ06nHzrm6ySuO/tax_ids\"\n  },\n  \"tax_info\":
        null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1169'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 21:46:40 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 6eadd6b6-fa24-44d8-82af-a813c8cade0e
      original-request:
      - req_MwVjdCX2TFovKn
      request-id:
      - req_MwVjdCX2TFovKn
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: customer=cus_FQ06nHzrm6ySuO
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '27'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - fce43948-9731-4d2d-a6b6-cdb03199372d
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_MwVjdCX2TFovKn", "request_duration_ms":
        314}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 57fc6466a65c 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/payment_methods/pm_card_chargeCustomerFail/attach
  response:
    body:
      string: "{\n  \"id\": \"pm_1EvA69FWLfbqapoHQzoPUeWo\",\n  \"object\": \"payment_method\",\n
        \ \"billing_details\": {\n    \"address\": {\n      \"city\": null,\n      \"country\":
        null,\n      \"line1\": null,\n      \"line2\": null,\n      \"postal_code\":
        null,\n      \"state\": null\n    },\n    \"email\": null,\n    \"name\":
        null,\n    \"phone\": null\n  },\n  \"card\": {\n    \"brand\": \"visa\",\n
        \   \"checks\": {\n      \"address_line1_check\": null,\n      \"address_postal_code_check\":
        null,\n      \"cvc_check\": null\n    },\n    \"country\": \"US\",\n    \"exp_month\":
        7,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"uTOMrpBJSijh5Bss\",\n
        \   \"funding\": \"credit\",\n    \"generated_from\": null,\n    \"last4\":
        \"0341\",\n    \"three_d_secure_usage\": {\n      \"supported\": true\n    },\n
        \   \"wallet\": null\n  },\n  \"created\": 1562881601,\n  \"customer\": \"cus_FQ06nHzrm6ySuO\",\n
        \ \"livemode\": false,\n  \"metadata\": {\n  },\n  \"type\": \"card\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '849'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 21:46:41 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - fce43948-9731-4d2d-a6b6-cdb03199372d
      original-request:
      - req_kEwpNoShLPqHi1
      request-id:
      - req_kEwpNoShLPqHi1
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: customer=cus_FQ06nHzrm6ySuO&default_payment_method=pm_1EvA69FWLfbqapoHQzoPUeWo&items[0][plan]=plan_FHjqReterVJV8l&expand[0]=latest_invoice.payment_intent
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '153'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - f017dc68-556b-40d9-9b9a-cb987e9139f8
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_kEwpNoShLPqHi1", "request_duration_ms":
        545}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 57fc6466a65c 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/subscriptions
  response:
    body:
      string: "{\n  \"id\": \"sub_FQ06xyRncsPCZB\",\n  \"object\": \"subscription\",\n
        \ \"application_fee_percent\": null,\n  \"billing\": \"charge_automatically\",\n
        \ \"billing_cycle_anchor\": 1562881601,\n  \"billing_thresholds\": null,\n
        \ \"cancel_at\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\":
        null,\n  \"collection_method\": \"charge_automatically\",\n  \"created\":
        1562881601,\n  \"current_period_end\": 1565560001,\n  \"current_period_start\":
        1562881601,\n  \"customer\": \"cus_FQ06nHzrm6ySuO\",\n  \"days_until_due\":
        null,\n  \"default_payment_method\": \"pm_1EvA69FWLfbqapoHQzoPUeWo\",\n  \"default_source\":
        null,\n  \"default_tax_rates\": [\n\n  ],\n  \"discount\": null,\n  \"ended_at\":
        null,\n  \"items\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n
        \       \"id\": \"si_FQ066L7BizX8vI\",\n        \"object\": \"subscription_item\",\n
        \       \"billing_thresholds\": null,\n        \"created\": 1562881602,\n
        \       \"metadata\": {\n        },\n        \"plan\": {\n          \"id\":
        \"plan_FHjqReterVJV8l\",\n          \"object\": \"plan\",\n          \"active\":
        true,\n          \"aggregate_usage\": null,\n          \"amount\": 999,\n
        \         \"billing_scheme\": \"per_unit\",\n          \"created\": 1560976015,\n
        \         \"currency\": \"usd\",\n          \"interval\": \"month\",\n          \"interval_count\":
        1,\n          \"livemode\": false,\n          \"metadata\": {\n          },\n
        \         \"nickname\": \"Holepunch Service: paid\",\n          \"product\":
        \"holepunch\",\n          \"tiers\": null,\n          \"tiers_mode\": null,\n
        \         \"transform_usage\": null,\n          \"trial_period_days\": null,\n
        \         \"usage_type\": \"licensed\"\n        },\n        \"quantity\":
        1,\n        \"subscription\": \"sub_FQ06xyRncsPCZB\",\n        \"tax_rates\":
        [\n\n        ]\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\":
        1,\n    \"url\": \"/v1/subscription_items?subscription=sub_FQ06xyRncsPCZB\"\n
        \ },\n  \"latest_invoice\": {\n    \"id\": \"in_1EvA69FWLfbqapoHevHosMvc\",\n
        \   \"object\": \"invoice\",\n    \"account_country\": \"US\",\n    \"account_name\":
        \"ORB.HOUSE, LLC\",\n    \"amount_due\": 999,\n    \"amount_paid\": 0,\n    \"amount_remaining\":
        999,\n    \"application_fee_amount\": null,\n    \"attempt_count\": 1,\n    \"attempted\":
        true,\n    \"auto_advance\": true,\n    \"billing\": \"charge_automatically\",\n
        \   \"billing_reason\": \"subscription_create\",\n    \"charge\": \"ch_1EvA69FWLfbqapoHawsFrjQw\",\n
        \   \"collection_method\": \"charge_automatically\",\n    \"created\": 1562881601,\n
        \   \"currency\": \"usd\",\n    \"custom_fields\": null,\n    \"customer\":
        \"cus_FQ06nHzrm6ySuO\",\n    \"customer_address\": null,\n    \"customer_email\":
        \"user@holepunch.io\",\n    \"customer_name\": null,\n    \"customer_phone\":
        null,\n    \"customer_shipping\": null,\n    \"customer_tax_exempt\": \"none\",\n
        \   \"customer_tax_ids\": [\n\n    ],\n    \"default_payment_method\": null,\n
        \   \"default_source\": null,\n    \"default_tax_rates\": [\n\n    ],\n    \"description\":
        null,\n    \"discount\": null,\n    \"due_date\": null,\n    \"ending_balance\":
        0,\n    \"footer\": null,\n    \"hosted_invoice_url\": \"https://pay.stripe.com/invoice/invst_f8UK9EIGeuj6OsY4Q00FkTPPnC\",\n
        \   \"invoice_pdf\": \"https://pay.stripe.com/invoice/invst_f8UK9EIGeuj6OsY4Q00FkTPPnC/pdf\",\n
        \   \"lines\": {\n      \"object\": \"list\",\n      \"data\": [\n        {\n
        \         \"id\": \"sli_1551f0aac0df3b\",\n          \"object\": \"line_item\",\n
        \         \"amount\": 999,\n          \"currency\": \"usd\",\n          \"description\":
        \"1 \xD7 Holepunch.io (at $9.99 / month)\",\n          \"discountable\": true,\n
        \         \"livemode\": false,\n          \"metadata\": {\n          },\n
        \         \"period\": {\n            \"end\": 1565560001,\n            \"start\":
        1562881601\n          },\n          \"plan\": {\n            \"id\": \"plan_FHjqReterVJV8l\",\n
        \           \"object\": \"plan\",\n            \"active\": true,\n            \"aggregate_usage\":
        null,\n            \"amount\": 999,\n            \"billing_scheme\": \"per_unit\",\n
        \           \"created\": 1560976015,\n            \"currency\": \"usd\",\n
        \           \"interval\": \"month\",\n            \"interval_count\": 1,\n
        \           \"livemode\": false,\n            \"metadata\": {\n            },\n
        \           \"nickname\": \"Holepunch Service: paid\",\n            \"product\":
        \"holepunch\",\n            \"tiers\": null,\n            \"tiers_mode\":
        null,\n            \"transform_usage\": null,\n            \"trial_period_days\":
        null,\n            \"usage_type\": \"licensed\"\n          },\n          \"proration\":
        false,\n          \"quantity\": 1,\n          \"subscription\": \"sub_FQ06xyRncsPCZB\",\n
        \         \"subscription_item\": \"si_FQ066L7BizX8vI\",\n          \"tax_amounts\":
        [\n\n          ],\n          \"tax_rates\": [\n\n          ],\n          \"type\":
        \"subscription\"\n        }\n      ],\n      \"has_more\": false,\n      \"total_count\":
        1,\n      \"url\": \"/v1/invoices/in_1EvA69FWLfbqapoHevHosMvc/lines\"\n    },\n
        \   \"livemode\": false,\n    \"metadata\": {\n    },\n    \"next_payment_attempt\":
        null,\n    \"number\": \"68ECEBEB-0001\",\n    \"paid\": false,\n    \"payment_intent\":
        {\n      \"id\": \"pi_1EvA69FWLfbqapoH7ksipNZt\",\n      \"object\": \"payment_intent\",\n
        \     \"amount\": 999,\n      \"amount_capturable\": 0,\n      \"amount_received\":
        0,\n      \"application\": null,\n      \"application_fee_amount\": null,\n
        \     \"canceled_at\": null,\n      \"cancellation_reason\": null,\n      \"capture_method\":
        \"automatic\",\n      \"charges\": {\n        \"object\": \"list\",\n        \"data\":
        [\n          {\n            \"id\": \"ch_1EvA69FWLfbqapoHawsFrjQw\",\n            \"object\":
        \"charge\",\n            \"amount\": 999,\n            \"amount_refunded\":
        0,\n            \"application\": null,\n            \"application_fee\": null,\n
        \           \"application_fee_amount\": null,\n            \"balance_transaction\":
        null,\n            \"billing_details\": {\n              \"address\": {\n
        \               \"city\": null,\n                \"country\": null,\n                \"line1\":
        null,\n                \"line2\": null,\n                \"postal_code\":
        null,\n                \"state\": null\n              },\n              \"email\":
        null,\n              \"name\": null,\n              \"phone\": null\n            },\n
        \           \"captured\": false,\n            \"created\": 1562881601,\n            \"currency\":
        \"usd\",\n            \"customer\": \"cus_FQ06nHzrm6ySuO\",\n            \"description\":
        \"Payment for invoice 68ECEBEB-0001\",\n            \"destination\": null,\n
        \           \"dispute\": null,\n            \"failure_code\": \"card_declined\",\n
        \           \"failure_message\": \"Your card was declined.\",\n            \"fraud_details\":
        {\n            },\n            \"invoice\": \"in_1EvA69FWLfbqapoHevHosMvc\",\n
        \           \"livemode\": false,\n            \"metadata\": {\n            },\n
        \           \"on_behalf_of\": null,\n            \"order\": null,\n            \"outcome\":
        {\n              \"network_status\": \"declined_by_network\",\n              \"reason\":
        \"generic_decline\",\n              \"risk_level\": \"normal\",\n              \"risk_score\":
        61,\n              \"seller_message\": \"The bank did not return any further
        details with this decline.\",\n              \"type\": \"issuer_declined\"\n
        \           },\n            \"paid\": false,\n            \"payment_intent\":
        \"pi_1EvA69FWLfbqapoH7ksipNZt\",\n            \"payment_method\": \"pm_1EvA69FWLfbqapoHQzoPUeWo\",\n
        \           \"payment_method_details\": {\n              \"card\": {\n                \"brand\":
        \"visa\",\n                \"checks\": {\n                  \"address_line1_check\":
        null,\n                  \"address_postal_code_check\": null,\n                  \"cvc_check\":
        null\n                },\n                \"country\": \"US\",\n                \"exp_month\":
        7,\n                \"exp_year\": 2020,\n                \"fingerprint\":
        \"uTOMrpBJSijh5Bss\",\n                \"funding\": \"credit\",\n                \"last4\":
        \"0341\",\n                \"three_d_secure\": null,\n                \"wallet\":
        null\n              },\n              \"type\": \"card\"\n            },\n
        \           \"receipt_email\": null,\n            \"receipt_number\": null,\n
        \           \"receipt_url\": \"https://pay.stripe.com/receipts/acct_1EO9vYFWLfbqapoH/ch_1EvA69FWLfbqapoHawsFrjQw/rcpt_FQ06AQIwCtWO3SCKN4nEUWsMVS6X8sM\",\n
        \           \"refunded\": false,\n            \"refunds\": {\n              \"object\":
        \"list\",\n              \"data\": [\n\n              ],\n              \"has_more\":
        false,\n              \"total_count\": 0,\n              \"url\": \"/v1/charges/ch_1EvA69FWLfbqapoHawsFrjQw/refunds\"\n
        \           },\n            \"review\": null,\n            \"shipping\": null,\n
        \           \"source\": null,\n            \"source_transfer\": null,\n            \"statement_descriptor\":
        null,\n            \"status\": \"failed\",\n            \"transfer_data\":
        null,\n            \"transfer_group\": null\n          }\n        ],\n        \"has_more\":
        false,\n        \"total_count\": 1,\n        \"url\": \"/v1/charges?payment_intent=pi_1EvA69FWLfbqapoH7ksipNZt\"\n
        \     },\n      \"client_secret\": \"pi_1EvA69FWLfbqapoH7ksipNZt_secret_Vy0gsGkC2AmJWeW3oLUhG2SU3\",\n
        \     \"confirmation_method\": \"automatic\",\n      \"created\": 1562881601,\n
        \     \"currency\": \"usd\",\n      \"customer\": \"cus_FQ06nHzrm6ySuO\",\n
        \     \"description\": \"Payment for invoice 68ECEBEB-0001\",\n      \"invoice\":
        \"in_1EvA69FWLfbqapoHevHosMvc\",\n      \"last_payment_error\": {\n        \"charge\":
        \"ch_1EvA69FWLfbqapoHawsFrjQw\",\n        \"code\": \"card_declined\",\n        \"decline_code\":
        \"generic_decline\",\n        \"doc_url\": \"https://stripe.com/docs/error-codes/card-declined\",\n
        \       \"message\": \"Your card was declined.\",\n        \"payment_method\":
        {\n          \"id\": \"pm_1EvA69FWLfbqapoHQzoPUeWo\",\n          \"object\":
        \"payment_method\",\n          \"billing_details\": {\n            \"address\":
        {\n              \"city\": null,\n              \"country\": null,\n              \"line1\":
        null,\n              \"line2\": null,\n              \"postal_code\": null,\n
        \             \"state\": null\n            },\n            \"email\": null,\n
        \           \"name\": null,\n            \"phone\": null\n          },\n          \"card\":
        {\n            \"brand\": \"visa\",\n            \"checks\": {\n              \"address_line1_check\":
        null,\n              \"address_postal_code_check\": null,\n              \"cvc_check\":
        null\n            },\n            \"country\": \"US\",\n            \"exp_month\":
        7,\n            \"exp_year\": 2020,\n            \"fingerprint\": \"uTOMrpBJSijh5Bss\",\n
        \           \"funding\": \"credit\",\n            \"generated_from\": null,\n
        \           \"last4\": \"0341\",\n            \"three_d_secure_usage\": {\n
        \             \"supported\": true\n            },\n            \"wallet\":
        null\n          },\n          \"created\": 1562881601,\n          \"customer\":
        \"cus_FQ06nHzrm6ySuO\",\n          \"livemode\": false,\n          \"metadata\":
        {\n          },\n          \"type\": \"card\"\n        },\n        \"type\":
        \"card_error\"\n      },\n      \"livemode\": false,\n      \"metadata\":
        {\n      },\n      \"next_action\": null,\n      \"on_behalf_of\": null,\n
        \     \"payment_method\": null,\n      \"payment_method_types\": [\n        \"card\"\n
        \     ],\n      \"receipt_email\": null,\n      \"review\": null,\n      \"setup_future_usage\":
        null,\n      \"shipping\": null,\n      \"source\": null,\n      \"statement_descriptor\":
        null,\n      \"status\": \"requires_payment_method\",\n      \"transfer_data\":
        null,\n      \"transfer_group\": null\n    },\n    \"period_end\": 1562881601,\n
        \   \"period_start\": 1562881601,\n    \"post_payment_credit_notes_amount\":
        0,\n    \"pre_payment_credit_notes_amount\": 0,\n    \"receipt_number\": null,\n
        \   \"starting_balance\": 0,\n    \"statement_descriptor\": null,\n    \"status\":
        \"open\",\n    \"status_transitions\": {\n      \"finalized_at\": 1562881601,\n
        \     \"marked_uncollectible_at\": null,\n      \"paid_at\": null,\n      \"voided_at\":
        null\n    },\n    \"subscription\": \"sub_FQ06xyRncsPCZB\",\n    \"subtotal\":
        999,\n    \"tax\": null,\n    \"tax_percent\": null,\n    \"total\": 999,\n
        \   \"total_tax_amounts\": [\n\n    ],\n    \"webhooks_delivered_at\": null\n
        \ },\n  \"livemode\": false,\n  \"metadata\": {\n  },\n  \"plan\": {\n    \"id\":
        \"plan_FHjqReterVJV8l\",\n    \"object\": \"plan\",\n    \"active\": true,\n
        \   \"aggregate_usage\": null,\n    \"amount\": 999,\n    \"billing_scheme\":
        \"per_unit\",\n    \"created\": 1560976015,\n    \"currency\": \"usd\",\n
        \   \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\":
        false,\n    \"metadata\": {\n    },\n    \"nickname\": \"Holepunch Service:
        paid\",\n    \"product\": \"holepunch\",\n    \"tiers\": null,\n    \"tiers_mode\":
        null,\n    \"transform_usage\": null,\n    \"trial_period_days\": null,\n
        \   \"usage_type\": \"licensed\"\n  },\n  \"quantity\": 1,\n  \"schedule\":
        null,\n  \"start\": 1562881601,\n  \"start_date\": 1562881601,\n  \"status\":
        \"incomplete\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\":
        null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '12124'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 21:46:42 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - f017dc68-556b-40d9-9b9a-cb987e9139f8
      original-request:
      - req_s1Rd6jHrTlDQkw
      request-id:
      - req_s1Rd6jHrTlDQkw
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
version: 1
