tests/unit/services/user/cassettes/TestUserStripeUnlink.test_user_unsubscribed_but_didnt_need_to.yaml

interactions:
- request:
    body: email=user%40holepunch.io&description=HP+TEST+2019-07-11+22%3A02%3A45.599005+None
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '81'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 48fff0d2-7dde-46cf-b0a0-91349dbe7823
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_6kLCB1mQMxPLEc", "request_duration_ms":
        268}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 223f0d2ec84e 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/customers
  response:
    body:
      string: "{\n  \"id\": \"cus_FQ0MD2zMU4J11o\",\n  \"object\": \"customer\",\n
        \ \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"created\":
        1562882565,\n  \"currency\": null,\n  \"default_source\": null,\n  \"delinquent\":
        false,\n  \"description\": \"HP TEST 2019-07-11 22:02:45.599005 None\",\n
        \ \"discount\": null,\n  \"email\": \"user@holepunch.io\",\n  \"invoice_prefix\":
        \"B2E014CA\",\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n    \"default_payment_method\":
        null,\n    \"footer\": null\n  },\n  \"livemode\": false,\n  \"metadata\":
        {\n  },\n  \"name\": null,\n  \"phone\": null,\n  \"preferred_locales\": [\n\n
        \ ],\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FQ0MD2zMU4J11o/sources\"\n  },\n  \"subscriptions\":
        {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\":
        false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_FQ0MD2zMU4J11o/subscriptions\"\n
        \ },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FQ0MD2zMU4J11o/tax_ids\"\n  },\n  \"tax_info\":
        null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1169'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 22:02:45 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 48fff0d2-7dde-46cf-b0a0-91349dbe7823
      original-request:
      - req_KbNuQ0WgKXo3Vg
      request-id:
      - req_KbNuQ0WgKXo3Vg
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: customer=cus_FQ0MD2zMU4J11o
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '27'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - c50071a7-5af9-4741-b548-dc61a25180fc
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_KbNuQ0WgKXo3Vg", "request_duration_ms":
        326}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 223f0d2ec84e 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/payment_methods/pm_card_visa/attach
  response:
    body:
      string: "{\n  \"id\": \"pm_1EvALiFWLfbqapoHPcfyGGvT\",\n  \"object\": \"payment_method\",\n
        \ \"billing_details\": {\n    \"address\": {\n      \"city\": null,\n      \"country\":
        null,\n      \"line1\": null,\n      \"line2\": null,\n      \"postal_code\":
        null,\n      \"state\": null\n    },\n    \"email\": null,\n    \"name\":
        null,\n    \"phone\": null\n  },\n  \"card\": {\n    \"brand\": \"visa\",\n
        \   \"checks\": {\n      \"address_line1_check\": null,\n      \"address_postal_code_check\":
        null,\n      \"cvc_check\": null\n    },\n    \"country\": \"US\",\n    \"exp_month\":
        7,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"5WF0F0bdzuufzLej\",\n
        \   \"funding\": \"credit\",\n    \"generated_from\": null,\n    \"last4\":
        \"4242\",\n    \"three_d_secure_usage\": {\n      \"supported\": true\n    },\n
        \   \"wallet\": null\n  },\n  \"created\": 1562882566,\n  \"customer\": \"cus_FQ0MD2zMU4J11o\",\n
        \ \"livemode\": false,\n  \"metadata\": {\n  },\n  \"type\": \"card\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '849'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 22:02:46 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - c50071a7-5af9-4741-b548-dc61a25180fc
      original-request:
      - req_CisbEeUsStJE0R
      request-id:
      - req_CisbEeUsStJE0R
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_CisbEeUsStJE0R", "request_duration_ms":
        548}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 223f0d2ec84e 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: GET
    uri: https://api.stripe.com/v1/subscriptions?plan=plan_FHjqReterVJV8l&customer=cus_FQ0MD2zMU4J11o&status=active
  response:
    body:
      string: "{\n  \"object\": \"list\",\n  \"data\": [\n\n  ],\n  \"has_more\":
        false,\n  \"url\": \"/v1/subscriptions\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '92'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 22:02:46 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_k8XE0o3AKhA1Zv
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
version: 1
